imported/solids4foam/tutorials/fluidSolidInteraction/3dTube/compressibleLiquid3dTube/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

# Check case version is correct
solids4Foam::convertCaseFormat .

solids4Foam::caseOnlyRunsWithFoamExtend

if [[ "${WM_PROJECT}" == "foam" ]]
then
    runApplication -l log.blockMesh.solid blockMesh -region solid
    runApplication -l log.blockMesh.fluid blockMesh -region fluid
else
    runApplication -s solid blockMesh -region solid
    runApplication -s fluid blockMesh -region fluid
fi

# Run solver
runApplication solids4Foam

# ----------------------------------------------------------------- end-of-file

